Repository: nbilgee123/fuel_tracker
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ar, mn, ru

source: Fill-up Date
ar: تاريخ التعبئة
mn: Шатахуун цэнэглэх огноо
ru: Дата заправки

source: Odometer Reading (km)
ar: قراءة عداد المسافات (كم)
mn: Хурдны хэмжүүрийн уншилт (км)
ru: Показания одометра (км)

source: Odometer reading must be positive
ar: يجب أن تكون قراءة عداد المسافات موجبة
mn: Хурдны хэмжүүрийн уншилт эерэг байх ёстой
ru: Показания одометра должны быть положительными

source: Fuel Amount (liters)
ar: كمية الوقود (لتر)
mn: Шатахууны хэмжээ (литр)
ru: Количество топлива (литры)

source: Fuel amount must be between 0.1 and 200 liters
ar: يجب أن تكون كمية الوقود بين 0.1 و 200 لتر
mn: Шатахууны хэмжээ 0.1-200 литр хооронд байх ёстой
ru: Количество топлива должно быть от 0.1 до 200 литров

source: Price per Liter (₮)
ar: السعر لكل لتر (₮)
mn: Литр тутамд үнэ (₮)
ru: Цена за литр (₮)

source: Price must be between ₮100 and ₮20000
ar: يجب أن يكون السعر بين ₮100 و ₮20000
mn: Үнэ ₮100-₮20000 хооронд байх ёстой
ru: Цена должна быть от ₮100 до ₮20000

source: Notes (optional)
ar: ملاحظات (اختياري)
mn: Тэмдэглэл (сонгох боломжтой)
ru: Примечания (необязательно)

source: Gas station, driving conditions, etc.
ar: محطة وقود، ظروف القيادة، إلخ
mn: Шатахуун түнш, жолоодох нөхцөл гэх мэт
ru: АЗС, условия вождения и т.д.

source: Add Fill-up
ar: إضافة تعبئة
mn: Цэнэглэлт нэмэх
ru: Добавить заправку

source: A fill-up with this odometer reading already exists.
ar: تعبئة بهذه القراءة من عداد المسافات موجودة بالفعل.
mn: Энэ хурдны хэмжүүрийн уншилттай цэнэглэлт аль хэдийн байна.
ru: Заправка с такими показаниями одометра уже существует.

source: Odometer reading must be greater than your last entry (%(reading)s km). If you want to start over, please reset your data.
ar: يجب أن تكون قراءة عداد المسافات أكبر من آخر إدخال لك (%(reading)s كم). إذا كنت تريد البدء من جديد، يرجى إعادة تعيين بياناتك.
mn: Хурдны хэмжүүрийн уншилт таны сүүлд оруулсан (%(reading)s км) -аас их байх ёстой. Дахин эхлэхийг хүсвэл өгөгдлөө дахин тохируулна уу.
ru: Показания одометра должны быть больше вашей последней записи (%(reading)s км). Если хотите начать заново, пожалуйста, сбросьте данные.

source: Vehicle Name
ar: اسم المركبة
mn: Тээврийн хэрэгслийн нэр
ru: Название транспортного средства

source: e.g., My Car, Family SUV
ar: مثال: سيارتي، سيارة عائلية
mn: жишээ нь: Миний машин, Гэр бүлийн SUV
ru: например: Моя машина, Семейный SUV

source: Fuel Tank Capacity (liters)
ar: سعة خزان الوقود (لتر)
mn: Шатахууны савны багтаамж (литр)
ru: Емкость топливного бака (литры)

source: Tank capacity must be between 20 and 200 liters
ar: يجب أن تكون سعة الخزان بين 20 و 200 لتر
mn: Савны багтаамж 20-200 литр хооронд байх ёстой
ru: Емкость бака должна быть от 20 до 200 литров

source: e.g., 50.0
ar: مثال: 50.0
mn: жишээ нь: 50.0
ru: например: 50.0

source: Save Settings
ar: حفظ الإعدادات
mn: Тохиргоог хадгалах
ru: Сохранить настройки

source: Language changed successfully!
ar: تم تغيير اللغة بنجاح!
mn: Хэл амжилттай өөрчлөгдлөө!
ru: Язык успешно изменен!

source: Language not supported.
ar: اللغة غير مدعومة.
mn: Хэл дэмжигдэхгүй.
ru: Язык не поддерживается.

source: Fill-up added successfully! Fuel efficiency: %(efficiency).1f L/100km
ar: تمت إضافة التعبئة بنجاح! كفاءة الوقود: %(efficiency).1f لتر/100كم
mn: Цэнэглэлт амжилттай нэмэгдлээ! Шатахууны хэрэглээ: %(efficiency).1f л/100км
ru: Заправка успешно добавлена! Расход топлива: %(efficiency).1f л/100км

source: Fill-up added successfully! Add more entries to see fuel efficiency.
ar: تمت إضافة التعبئة بنجاح! أضف المزيد من الإدخالات لرؤية كفاءة الوقود.
mn: Цэнэглэлт амжилттай нэмэгдлээ! Шатахууны хэрэглээг харахын тулд илүү олон бичлэг нэмнэ үү.
ru: Заправка успешно добавлена! Добавьте больше записей, чтобы увидеть расход топлива.

source: Error adding fill-up: %(error)s
ar: خطأ في إضافة التعبئة: %(error)s
mn: Цэнэглэлт нэмэхэд алдаа гарлаа: %(error)s
ru: Ошибка при добавлении заправки: %(error)s

source: Please enter a valid fuel amount greater than 0.
ar: يرجى إدخال كمية وقود صحيحة أكبر من 0.
mn: 0-ээс их хүчинтэй шатахууны хэмжээг оруулна уу.
ru: Пожалуйста, введите действительное количество топлива больше 0.

source: Fuel amount seems unusually high. Please check your input.
ar: كمية الوقود تبدو عالية بشكل غير عادي. يرجى التحقق من إدخالك.
mn: Шатахууны хэмжээ хэт өндөр байна. Оруулсан утгаа шалгана уу.
ru: Количество топлива кажется необычно высоким. Пожалуйста, проверьте введенные данные.

source: Range calculated successfully! Based on your average efficiency of %(efficiency).1f L/100km.
ar: تم حساب المدى بنجاح! بناءً على متوسط كفاءتك %(efficiency).1f لتر/100كم.
mn: Зай амжилттай тооцоологдлоо! Таны дундаж хэрэглээ %(efficiency).1f л/100км дээр суурилсан.
ru: Запас хода успешно рассчитан! Основано на вашем среднем расходе топлива %(efficiency).1f л/100км.

source: Please enter a valid number for fuel amount.
ar: يرجى إدخال رقم صحيح لكمية الوقود.
mn: Шатахууны хэмжээнд хүчинтэй тоо оруулна уу.
ru: Пожалуйста, введите действительное число для количества топлива.

source: Fill-up from %(date)s deleted successfully.
ar: تم حذف التعبئة من %(date)s بنجاح.
mn: %(date)s-ны цэнэглэлт амжилттай устгагдлаа.
ru: Заправка от %(date)s успешно удалена.

source: Error deleting fill-up: %(error)s
ar: خطأ في حذف التعبئة: %(error)s
mn: Цэнэглэлт устгахад алдаа гарлаа: %(error)s
ru: Ошибка при удалении заправки: %(error)s

source: Vehicle settings updated successfully!
ar: تم تحديث إعدادات المركبة بنجاح!
mn: Тээврийн хэрэгслийн тохиргоо амжилттай шинэчлэгдлээ!
ru: Настройки транспортного средства успешно обновлены!

source: Error updating vehicle settings: %(error)s
ar: خطأ في تحديث إعدادات المركبة: %(error)s
mn: Тээврийн хэрэгслийн тохиргоог шинэчлэхэд алдаа гарлаа: %(error)s
ru: Ошибка при обновлении настроек транспортного средства: %(error)s

source: Fuel Tracker
ar: متتبع الوقود
mn: Шатахуун хянагч
ru: Трекер топлива

source: Home
ar: الرئيسية
mn: Нүүр
ru: Главная

source: History
ar: التاريخ
mn: Түүх
ru: История

source: Charts
ar: الرسوم البيانية
mn: График
ru: Графики

source: Range
ar: المدى
mn: Зай
ru: Запас хода

source: Settings
ar: الإعدادات
mn: Тохиргоо
ru: Настройки

source: Welcome to Your Fuel Tracker!
ar: مرحباً بك في متتبع الوقود الخاص بك!
mn: Шатахуун хянагчдаа тавтай морил!
ru: Добро пожаловать в ваш трекер топлива!

source: Track your fuel consumption and monitor your car's efficiency.
ar: تتبع استهلاك الوقود وراقب كفاءة سيارتك.
mn: Шатахууны хэрэглээг хянаж, машины үр ашгийг хянана уу.
ru: Отслеживайте расход топлива и контролируйте эффективность вашего автомобиля.

source: Quick Stats
ar: إحصائيات سريعة
mn: Хурдан статистик
ru: Быстрая статистика

source: Total Fill-ups
ar: إجمالي التعبئات
mn: Нийт цэнэглэлт
ru: Всего заправок

source: Average Efficiency
ar: متوسط الكفاءة
mn: Дундаж үр ашиг
ru: Средняя эффективность

source: Total Spent
ar: إجمالي ما تم إنفاقه
mn: Нийт зарцуулсан
ru: Всего потрачено

source: Current Fuel Status
ar: حالة الوقود الحالية
mn: Одоогийн шатахууны төлөв
ru: Текущий статус топлива

source: Tank Capacity
ar: سعة الخزان
mn: Савны багтаамж
ru: Емкость бака

source: Remaining Fuel
ar: الوقود المتبقي
mn: Үлдсэн шатахуун
ru: Оставшееся топливо

source: full
ar: ممتلئ
mn: бүрэн
ru: полный

source: Predicted Range
ar: المدى المتوقع
mn: Урьдчилан таамагласан зай
ru: Прогнозируемый запас хода

source: Based on
ar: بناءً على
mn: Суурилсан
ru: Основано на

source: efficiency
ar: الكفاءة
mn: үр ашиг
ru: эффективности

source: Record Your First Fill-up
ar: سجل أول تعبئة لك
mn: Анхны цэнэглэлтээ бүртгэх
ru: Записать вашу первую заправку

source: Add Another Fill-up
ar: أضف تعبئة أخرى
mn: Өөр цэнэглэлт нэмэх
ru: Добавить еще одну заправку

source: Check Driving Range
ar: تحقق من مدى القيادة
mn: Жолоодох зайг шалгах
ru: Проверить запас хода

source: Vehicle Settings
ar: إعدادات المركبة
mn: Тээврийн хэрэгслийн тохиргоо
ru: Настройки транспортного средства
